{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-NACIMIENTO",
    "2": "I-NACIMIENTO",
    "3": "B-PATERNO",
    "4": "I-PATERNO",
    "5": "B-MATERNO",
    "6": "I-MATERNO",
    "7": "B-NOMBRE",
    "8": "I-NOMBRE",
    "9": "B-SEXO",
    "10": "B-DOMICILIO",
    "11": "I-DOMICILIO",
    "12": "B-MUNICIPIO",
    "13": "I-MUNICIPIO",
    "14": "B-CLAVE",
    "15": "I-CLAVE",
    "16": "B-CURP",
    "17": "I-CURP",
    "18": "B-SECCION",
    "19": "I-SECCION",
    "20": "B-VIGENCIA",
    "21": "I-VIGENCIA"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CLAVE": 14,
    "B-CURP": 16,
    "B-DOMICILIO": 10,
    "B-MATERNO": 5,
    "B-MUNICIPIO": 12,
    "B-NACIMIENTO": 1,
    "B-NOMBRE": 7,
    "B-PATERNO": 3,
    "B-SECCION": 18,
    "B-SEXO": 9,
    "B-VIGENCIA": 20,
    "I-CLAVE": 15,
    "I-CURP": 17,
    "I-DOMICILIO": 11,
    "I-MATERNO": 6,
    "I-MUNICIPIO": 13,
    "I-NACIMIENTO": 2,
    "I-NOMBRE": 8,
    "I-PATERNO": 4,
    "I-SECCION": 19,
    "I-VIGENCIA": 21,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31002
}
